/* By https://github.com/DIEGO-OFC/DORRAT-BOT-MD */

const handler = async (m, {conn, text}) => {
  m.reply(`*╔═══════════════════════════*\n➢ *"${pickRandom(global.piropo)}"*\n*╚═══════════════════════════*`);
};
handler.tags = ['frases'];
handler.command = ['غزل'];
export default handler;

function pickRandom(list) {
  return list[Math.floor(list.length * Math.random())];
}

global.piropo = [
  'أود أن أكون ورقة لألف أيضًا ألفك هذا الحلو.',
  'أنت مثل واي فاي بدون كلمة مرور، يبحث الجميع عنك.',
  'من يكون حافلة للتجول في منحنيات قلبك.',
  'أريد أن أطير بدون أجنحة والخروج من هذا الكون والدخول إلى كونك وأحبك في صمت.',
  'أود أن أكون زبدة لأن أذوب في رغيف الخبز الخاص بك.',
  'إذا كانت الجمال جريمة، فإنك بالفعل في الجحيم.',
  'أود أن أكون قطة لأمضي 7 حياة بجانبك.',
  'سرقة خطأ ولكن قبلة من فمك سأسرقها.',
  'كم هو جميل السماء عندما تكون صافية ولكن الحب أجمل عندما أكون معك.',
  'جميلة، تمشي في الظلام، الشمس تذوب الشوكولاتة.',
  'إذا كنت بريدًا إلكتروني، ستكونين كلمة مروري.',
  'أتمنى أن تكون جبلًا حتى يمكنني أن أعطيك ماشيتي.',
  'فقدت رقم هاتفي، هل يمكنك إعطائي رقمك؟',
  'ما اسمك لأطلبك كهدية من سانتا كلوز؟',
  'في السماء هناك العديد من النجوم، ولكن الألمع هو على الأرض وأنت.',
  'هل توقفت الشمس عندما أعطيت لي ابتسامتك اليوم؟',
  'ليس الرون ولا البيرة، أنتم من رفع رأسي.',
  'إذا تحدثنا عن الرياضيات، فأنت مجموع كل رغباتي.',
  'تبدو كجوجل لأن لديك كل ما أبحث عنه.',
  'قهوتي المفضلة هي من عيونك.',
  'أريد أن أكون فوتوشوب لتعديل كل جسدك.',
  'أود أن تكون حبوب الإفطار حتى يمكنني أن أملأ ملعقتي في الصباح.',
  'من كان جائعًا لأعطيك ثلاث وجبات في اليوم.'];
