const handler = async (m, {conn}) => {
  m.reply(global.terminos);
};
handler.customPrefix = /الخصوصيه|سياسه-الخصوصيه|الخصوصية|terminos y condiciones|terminos de uso|Terminos de uso|Terminó se uso|términos de uso|Términos de uso|Términos y condiciones/i;
handler.command = new RegExp;
export default handler;

global.terminos = `
*=> الجهل بما يتم ذكره هنا لا يعفي مالك البوت أو المستخدم من العقوبات التي قد تنجم عنها! ❗*

*⚠️ سياسة الخصوصية*
_1.- المعلومات التي يتلقاها البوت لا تتم مشاركتها مع أي جهة ثالثة أو أي شخص_
_2.- الصور/الفيديوهات/الملصقات/الصوتيات/الخ لا تتم مشاركتها مع أي شخص_
_3.- رقم هاتفك لا يتم مشاركته مع أي شخص على الإطلاق_
_4.- يتم حذف بيانات البطاقات، المواقع، العناوين، الخ على الفور ولا تتم مشاركتها مع أي شخص_
_5.- يتم حذف جميع المحادثات بشكل دوري ولا يتم إجراء نسخ احتياطي (لن يتم الاحتفاظ) بأي نوع من المعلومات/المحادثات_

*⚠️ شروط الاستخدام*
_1.- لا نتحمل مسؤولية أي استخدام غير صحيح للبوت_
_2.- لا نتحمل مسؤولية الجهل و/أو عدم معرفة الموضوع_
_3.- البوت ليس نشطًا على مدار 24 ساعة ما لم يقرر مالك البوت خلاف ذلك_
_4.- الشركة لا تتحمل مسؤولية استخدام البوت أو البوتات الفرعية غير الرسمية، حيث إنها تتعامل مع أفراد (أطراف ثالثة) وليس لدينا سيطرة عليهم_
_5.- لا نتحمل مسؤولية الأرقام التي قد تذهب إلى الدعم بسبب استخدام البوت، فإنه دائمًا من المستحسن استخدام أرقام افتراضية لأغراض البوت_
_6.- الصوتيات/الملاحظات الصوتية/الصور/الفيديوهات أو أي ملف وسائط آخر هي ملك للبوت The Zoro فقط، إذا تم اكتشاف وجودها في بوت آخر، سيتم اتخاذ الإجراءات اللازمة._

*➤ رسالة من رقم البوت؟*
_- إذا تلقيت في أي وقت رسالة من رقم البوت وليست أمرًا ربما تكون من مالك البوت أو مالك الرقم، فهذا شخص حقيقي لذا يُرجى عدم فقدان الاحترام له_

*➤ الشكر ل:*
*- YOSEF*

*⁉️ هل لديك أي أسئلة؟*
_- إذا كنت لا تزال تواجه أي استفسار أو شكوى بشأن ما تم ذكره هنا أو بخصوص البوت، اتصل بي على رقمي الشخصي الذي سأرد عليه في أقرب وقت ممكن لتقديم حلاً أو لتحمل مسؤولية أي شكوى_

> wa.me/201032389641
> YOSEF ZORO
> كل حساباتي: https://solo.to/yosef.zoro

*∆ THE ZORO - BOT - MD ∆*`;
